rand(5)
randn(5)   %random 随机 normal 正态，高斯 随机正态分布;均值 0，方差1，数值有正有负，集中在0附近
eye(3,5)
A=rand(5,4)
flipud(A)  %flip=翻动，转动;u up; d down 上下
fliplr(A)  %flip=翻动，转动;l left;r right 左右
rot90(A)   %rotate 旋转 ;逆时针
%%%%%%%%%%%%%%%%%%%
A=[1 3 5;4 9 3;2 0 5]
A'   %A转置
det(A) %A的  determinant：行列式
rank(A)%A的秩 rank ：秩
inv(A) %A的逆  inverse：相反的、逆的
eig(A) %eigen：本征的、固有的、自身的。翻译过来是特征值，本征值
[X,D]=eig(A)%A的特征矢量矩阵及特征值对角阵
A^2%矩阵A的幂运算
%%%%%%%%%%%%%%%%%%%
A1=[1 2 3;4 5 6;7 8 9]
A2=A1'
A3=A1-A2
B1=cat(1,A1,A2,A3)%concatenate 连接 1：一维。竖直上下拼接（行拼接） 
B2=cat(2,A1,A2,A3)%2：二维。水平左右拼接（列拼接）
B3=cat(3,A1,A2,A3)%页/层 往后叠成一叠 "书页"。往后叠加
%还可以怎么实现以上的拼接结果？
[A1;A2;A3]
[A1 A2 A3]
%%%%%%%%%%%%%%%%%%%%%%%
s='Hello'
s=[s;'Hello']
whos s
n=input('Pls input the number of apples!')
%%%%%%%%%%%%%%%%%%%%%%%%%%
% 1. 读入自带彩色图
I = imread('peppers.png');
% 2. 分离 R G B 三个通道（每一层都是灰度图）
R = I(:,:,1);  % 红色通道 这里I是刚刚导入图片的变量名
G = I(:,:,2);  % 绿色通道 I( 行 , 列 , 层 )
B = I(:,:,3);  % 蓝色通道
I2 = cat(3, R, G, B);% 3. 关键：用 cat(3) 把三层重新合成彩色图
figure% 4. 子图对比显示
subplot(2,2,1); imshow(R); title('红色通道灰度图')
subplot(2,2,2); imshow(G); title('绿色通道灰度图')
subplot(2,2,3); imshow(B); title('蓝色通道灰度图')
subplot(2,2,4); imshow(I2); title('cat(3)合成还原彩色图')

%%%%%%%%%%%%%%%%%%%%%%%
%1.生成一个[-1,1]区间分布的随机阵，统计其中绝对值大于0.5的元素的个数，并输出这些元素。
A=2*rand(5)-1   %absolute 绝对值
idx=abs(A)>0.5  %idx=index 索引、位置,idx是一个和A一样大的0/1矩阵，标记哪些位置符合条件,idx就是一个矩阵/变量名
count =nnz(idx);%nnz=Number of Non-Zero  非零数
vals=A(idx)
% idx 是同大小逻辑矩阵,MATLAB里面用逻辑矩阵当索引，会自动把所有为 1 的位置对应的元素提取出来。

%%%%%%%%%%%%%%%%%%%%%%
%将A的第2行元素扩大2倍后作为A的第3行元素。
A=rand(5)
A(3,:)         % 只读取、只显示第3行，不修改A
A(3,:)=2*A(2,:)% 赋值修改A的第3行，改动整个矩阵A
%输入任意矩阵A、B（它们的元素个数相等），命令A(: )和A(: )=B会产生什么结果？
A=rand(5)
B=rand(5)
A(:)%无视行列结构，取出全体元素，按列优先顺序排成一维列向量
A(:)=B %把A和B全部拉成一列然后逐个赋值，然后再填入A原本的框架中。这样做的好处是只需要AB两个矩阵的元素个数相同就行

%A=[1,3,5; 5,8,3;6,1,6]，B=[3,6;9,3;4,7]，C=[3,7,9;4,5,7],D=2:6
%体会命令[A,B]，[A;C]，[A,B;D]所产生的结果，学习由小矩阵生成大矩阵的方法。
A=[1,3,5; 5,8,3;6,1,6]
B=[3,6;9,3;4,7]
C=[3,7,9;4,5,7]
D=2:6
[A,B] %逗号横着拼接
[A;C] %分号竖直拼接
[A,B;D] %先逗号再分号，直接把D放到最下面了

%. 产生5阶随机方阵A，其元素为[10,90]区间的随机整数，然后只保留A中是3的倍数的元素。
A=randi([10,90],5,5)  %randi random integer  随机整数 randi([最小值,最大值],行数,列数)
idx=mod(A,3)==0       %modulus 取余数 mod(x,3) → x 除以 3 的余数
res=A(idx)

%计算表达式
exp(12) + 23^3*log2(5)/tan(deg2rad(21))  %degree 度 rad 弧度 
%tan(x) 默认以弧度为单位，所以需要用 deg2rad 把 21° 转换成弧度

%已知矩阵A=[5 2;9 1]，B=[1 2;9 2],做简单的关系运算A>B，A==B，A<B，并做逻辑运算(A==B)&(A<B)，(A==B)&(A>B)。
A=[5 2;9 1]
B=[1 2;9 2]
A>B
A==B
A<B
(A==B)&(A<B)
(A==B)&(A>B)

%用结构阵列生成student变量，创建以下3位学生的信息
student=struct(...
    'name',{'John','Rose','Biliy'}, ...
    'id',{2017012043,2017012068,2017012056}, ...
    'grade',{[85,96,74,82,68],[95,93,84,72,88],[72,83,80,78,93]}...
    )
student(2).score(2)=83
[student.gender] = deal('男','女','男')
