%homework2:
c=[1 3 5 7 8]   
d=1:2:13
e=linspace(1,11,1)%linspace(a,b,n)生成包含a和b的均分向量,所以当取1时候输出b，取2输出a，b，取三以上才开始均分
%%%%%%%
A = [3,5,6; 
    2,5,8; 
    3,5,9; 
    3,7,9]
[n,m]=size(A)%就是求出矩阵 A 有几行、几列。主要是遍历的时候有用
% [n,m] = size(A);
% for i = 1:n
%    for j = 1:m
%        A(i,j)
%   end
%end
A(1,3)

%%%%%%%%%%%%%%%%%%%%%%%
A(2,:)    %第二行全部
A([1,3],:)% 第1和第3行全部  [1,3]本质上是一个数组
A(2:3,1:2)
%如何将A的2,3列互换？
A(:,[1,3,2])
%%%%%%%%%%%%%%%%%%%%%%%
A=[3,5,8;
   -2,3,6;
   1,4,9]
B=rand(3,3)
C=A+B
D=A-B
E=A*B   %前行乘后列，乘完加一起
E=A.*B  %对应元素相乘
F=A/B   %A乘B逆
F=A\B   %A逆乘B
F=A./B;%对应元素相除
A^2     %A*A
A.^2    %A.*A
%%%%%%%%%%
A=[1 2;3 4]
B=[0 6;0 8]
A|B  %或：有真为真
A&B  %与  全真为真
xor(A,B)  %异或：相同为假，不同为真
%%%%%%%%%%
a=-5
b=-10
(b~=0)&&(a/b>5)  %全真为真
(b==0)||(a/b>0)  %有真为真
~a               %非：取反
%%%%%%%%%%%%%%%%%%
%输入一个矩阵A，取出A的第2行第1列的元素；取出A的第1，3，4列的所有元素；让A的第1列和第3列互换；删除A的第二列。
A=[1   2  3    4;
   5   6  7    8;
   9  10  11  12;
  13  14  15  16]
A(2,1)
A(:,[1,3,4])
A(:,[3,2,1,4])
A(:,[1,3,4])
%%%%%%%%%%%%%%%%%%%
%用MATLAB可以识别的格式输入下面两个矩阵。再求出它们的乘积矩阵C，并将C矩阵的右下角2×3子矩阵赋给D矩阵，赋值完成之后，调用相应的命令，查看MATLAB工作空间的情况。
A=[1 2 3 3;2 3 5 7;1 3 5 7;3 2 3 9;1 8 9 4]
B=[1+4i 4 3 6 7 8;2 3 3 5 5 4+2i;2 6+7i 5 3 4 2;1 8 9 5 4 3]
C=A*B
D=C([4,5],[4,5,6])
whos D
%%%%%%%%%%%%%%%%%%
%求i）A*B-2*A    ii）A*B    iii）A.*B    iv）A*B-B*A
A=[1 1 1;-1 1 1;1 -1 1]
B=[1 2 1;1 3 -1;2 1 4]
A*B-2*A
A*B
A.*B
A*B-B*A
%%%%%%%%%%%%%%%%%%
%已知x=[1 2 3],y=[4 5 6],试计算z=x.*y、x./y和x.\y。
x=[1 2 3]
y=[4 5 6]
z=x.*y
x./y
x.\y
%%%%%%%%%%%%%%%
%解线性方程
A=[5 7 6 5 1;
    7 10 8 7 2;
    6 8 10 9 3;
    5 7 9 10 4;
    1 2 3 4 5]
B=[ 23 96;
    34 136
    36 144;
    35 140;
    15 60]
X=inv(A)*B
X=A\B
%%%%%%%%%%%%%%%%%%
%解方程组
A=[1 1 1 0;
    1 2 1 -1;
    2 -1 0 -3;
    3 3 5 -6]
B=[1;8;3;5]
C=A\B
x=C(1)
y=C(2)
c=C(3)
z=C(4)
%%%%%%%%%%%%%%%
%以下语句为一幅灰度图像前后各加上了一道宽15个像素的白边：
I=imread('peppers.png');%读入图像   imread image read 读入图像
imshow(I)               %显示图像   imshow image show 显示图像 im开头均为图像相关
I1=rgb2gray(I);%彩色图像变灰度图像  RGB Red Green Blue
imshow(I1)
B=255*ones(size(I1,1),15); %白色像素值为255 黑色像素值为0 
%size(矩阵/图像, 维度)
%size(I1, 1) → 取 I1 的行数（图像高度，有多少行像素）
%size(I1, 2) → 取 I1 的列数（图像宽度，有多少列像素）
%ones(行数, 列数)
%ones=多个1 生成全1矩阵  zeros=多个0 生成全0矩阵
imshow(B)%只显示B这条白边
I2=[B I1 B]; %把白边加在前后
imshow(I2) %显示加上白边的结果
%subplot 子绘图 sub前缀：次要的、从属的、子的、分支的；比如：subway地铁、subordinate下属、subfolder 子文件夹
%eye 单位矩阵  谐音I->数学里I表示单位矩阵
%linspace lin=linear线性的 线性空间

%请继续完成给I2图像上下各加一道厚15个像素的白边，并显示最终结果。
B2=255*ones(15,size(I1,2));
I3=[B2;I1;B2];
imshow(I3)

%%%%%%%%%%%%%%
%产生3×4维全1矩阵，产生4×2维的随机矩阵，产生4×4的单位矩阵
ones(3,4,5)
rand(4,2)
eye(4)
